InformationRegisters/ПланВходящихКонтактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланВходящихКонтактов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПланВходящихКонтактов/Ext/ManagerModule.bsl
Процедура ЗаписатьДанныеВПланВходящихКонтактов(ТочкаПродаж, НомерГод, НомерМесяц, Количество) Экспорт
	
	ДатаПериода = НачалоМесяца(Дата(НомерГод,НомерМесяц,1,0,0,1));
	ПланНаборЗаписей = РегистрыСведений.ПланВходящихКонтактов.СоздатьНаборЗаписей();
	ПланНаборЗаписей.Отбор.Год.Установить(НомерГод);
	ПланНаборЗаписей.Отбор.Месяц.Установить(ДатаПериода);
	ПланНаборЗаписей.Отбор.ТочкаПродаж.Установить(ТочкаПродаж);
	ПланНаборЗаписей.Прочитать();
	Если ПланНаборЗаписей.Количество() = 0 Тогда
		НовыйПлан = ПланНаборЗаписей.Добавить();
	Иначе
		НовыйПлан = ПланНаборЗаписей[0];
	КонецЕсли;
	НовыйПлан.Год = НомерГод;
	НовыйПлан.Месяц = ДатаПериода;
	НовыйПлан.ТочкаПродаж = ТочкаПродаж;
	НовыйПлан.Количество = Количество;
	ПланНаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьДанныеИзПланаВходящихКонтактов(ТочкаПродаж, НомерГод, НомерМесяц) Экспорт
	
	ДатаПериода = НачалоМесяца(Дата(НомерГод,НомерМесяц,1,0,0,1));
	ПланНаборЗаписей = РегистрыСведений.ПланВходящихКонтактов.СоздатьНаборЗаписей();
	ПланНаборЗаписей.Отбор.Год.Установить(НомерГод);
	ПланНаборЗаписей.Отбор.Месяц.Установить(ДатаПериода);
	ПланНаборЗаписей.Отбор.ТочкаПродаж.Установить(ТочкаПродаж);
	ПланНаборЗаписей.Прочитать();
	ПланНаборЗаписей.Удалить(0);
	ПланНаборЗаписей.Записать();
	
КонецПроцедуры
